---
kind: other
id: Properties.T:Autodesk.Revit.DB.UpdaterRegistry
source: html/39b4ef60-75a0-b512-f7c1-fcbecd3f31a1.htm
---
# UpdaterRegistry Properties

Specifies whether the .NET object represents a valid Revit entity.